uhnp/src/Enums/СостоянияДоговоров/СостоянияДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДоговоров</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>ПереданНаПодписьКонтрагенту</name>
  </enumValues>
  <enumValues>
    <name>ПереданНаПодписьОрганизации</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>Исполняется</name>
  </enumValues>
  <enumValues>
    <name>Исполнен</name>
  </enumValues>
  <enumValues>
    <name>Расторгнут</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>Возвращен</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияДоговоров/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.СостоянияДоговоров.Черновик);
	ДанныеВыбора.Добавить(Перечисления.СостоянияДоговоров.ПереданНаПодписьКонтрагенту);
	ДанныеВыбора.Добавить(Перечисления.СостоянияДоговоров.ПереданНаПодписьОрганизации);
	ДанныеВыбора.Добавить(Перечисления.СостоянияДоговоров.Подписан);
	ДанныеВыбора.Добавить(Перечисления.СостоянияДоговоров.Исполняется);
	ДанныеВыбора.Добавить(Перечисления.СостоянияДоговоров.Исполнен);
	ДанныеВыбора.Добавить(Перечисления.СостоянияДоговоров.Расторгнут);
	ДанныеВыбора.Добавить(Перечисления.СостоянияДоговоров.Приостановлен);
	ДанныеВыбора.Добавить(Перечисления.СостоянияДоговоров.Возвращен);
КонецПроцедуры
